#!/bin/sh

#====================================
# プロンプトの設定
#------------------------------------
# 色一覧
#------------------------------------
# 00: なにもしない
# 01: 太字化
# 04: 下線
# 05: 点滅
# 07: 前背色反転
# 08: 表示しない
# 22: ノーマル化
# 24: 下線なし
# 25: 点滅なし
# 27: 前背色反転なし
# 30: 黒(前景色)
# 31: 赤(前景色)
# 32: 緑(前景色)
# 33: 茶(前景色)
# 34: 青(前景色)
# 35: マゼンタ(前景色)
# 36: シアン(前景色)
# 37: 白(前景色)
# 39: デフォルト(前景色)
# 40: 黒(背景色)
# 41: 赤(背景色)
# 42: 緑(背景色)
# 43: 茶(背景色)
# 44: 青(背景色)
# 45: マゼンタ(背景色)
# 46: シアン(背景色)
# 47: 白(背景色)
# 49: デフォルト(背景色)
#------------------------------------
# プロンプト表示フォーマット
#------------------------------------
# %% %を表示
# %) )を表示
# %l 端末名省略形
# %M ホスト名(FQDN)
# %m ホスト名(サブドメイン)
# %n ユーザー名
# %y 端末名
# %# rootなら#、他は%を表示
# %? 直前に実行したコマンドの結果コード
# %d ワーキングディレクトリ %/ でも可
# %~ ホームディレクトリからのパス
# %h ヒストリ番号 %! でも可
# %a The observed action, i.e. "logged on" or "logged off".
# %S (%s) 反転モードの開始/終了 %S abc %s とするとabcが反転

case ${UID} in
  0)
    PROMPT="%{%}%/%{%} %# "
    PROMPT2="%{%}%/%{%} %# "
    SPROMPT="%B%{%}%r is correct? [n,y,a,e]:%{%} %b "
    RPROMPT="%1(v|%F{green}%1v%f|)"
    [ -n "${REMOTEHOST}${SSH_CONNECTION}" ] &&
        PROMPT="%{%}${HOST%%.*} ${PROMPT}"
    ;;
  *)
    PROMPT="%{32+$RANDOM % 5]m%}%/%{%} %# "
    PROMPT2="%{%}%/%{%} %# "
    SPROMPT="%{%}%r is correct? [n,y,a,e]:%{%} "
    RPROMPT="%1(v|%F{green}%1v%f|)"
    [ -n "${REMOTEHOST}${SSH_CONNECTION}" ] &&
        PROMPT="%{%}${HOST%%.*} ${PROMPT}"
    ;;
esac
